[{
    "title": "Chocolate Zucchini Bread",
    "cuisine": "American",
    "course": ["Dessert", "Breakfast"],
    "mainDish": "Other",
    "prepTime": 10,
    "cookTime": 50,
    "totalTime": null,
    "notes": "*You do not need to peel the zucchini before grating. Cut off the ends, then hold the zucchini perpendicular (90-degree angle) to your grated to avoid long strands of zucchini. Wrap the bread tightly in plastic wrap and store at room temperature for up to 4 days. Bread can also be frozen (after being cooled fully). Wrap tightly and freeze for up to 2 months, then thaw in the fridge.",
    "serves": 10,
    "serveType": "slices",
    "description": "Chocolate zucchini bread that’s incredibly moist, not too sweet, and packed with chocolate chips. The grated zucchini dissolves as it bakes - leaving you with a delicious chocolate loaf that's deliciously tender.",
    "recipeOrigin": "https://www.justsotasty.com/chocolate-zucchini-bread/",
    "equipmentNeeded": [
      "8 1/2 by 4 1/2 inch loaf pan",
      "Parchment Paper",
      "Medium bowl",
      "Large bowl "
    ],
    "ingredients": [
      "1 1/2 cups grated zucchini*",
      "1 1/4 cup all-purpose flour",
      "1/3 cup cocoa powder",
      "1 teaspoon baking soda",
      "1/4 teaspoon salt",
      "1/2 cup unsalted butter, melted",
      "3/4 cup brown sugar",
      "2 large eggs",
      "2 teaspoons vanilla extract",
      "1 cup chocolate chips"
    ],
    "instructions": [
      "Preheat the oven to 350F degrees. Line the bottom of an 8 1/2 by 4 1/2 inch loaf pan with parchment paper, then grease and flour the sides.",
      "Gently blot the grated zucchini with a paper towel to remove excess water.",
      "In a medium bowl whisk together the flour, cocoa, baking soda and salt.",
      "In a large bowl whisk together the melted butter, sugar, eggs and vanilla extract until there are no chunks of sugar.",
      "Gently fold the flour mixture into the oil mixture.",
      "Once almost combined, stir in the grated zucchini.",
      "Fold in the chocolate chips.",
      "Pour the batter into the prepared pan, and bake for 45-55 minutes until the top is firm to the touch and an inserted toothpick comes out clean (except for melted chocolate chips).",
      "Cool fully before cutting into slices."
    ]
  },
  {
    "title": "Gluten-Free Lemon Bars With Almond Flour Crust ",
    "cuisine": "American",
    "course": "Dessert",
    "mainDish": "Other",
    "prepTime": 30,
    "cookTime": 60,
    "totalTime": null,
    "notes": "",
    "serves": 3,
    "serveType": "",
    "description": "With a buttery crust and luscious lemon curd, these tangy lemon bars taste like a fancy French tart in bar form. They happen to be gluten-free too. But if gluten isn't an issue for you, replace the sweet rice, oat, and tapioca flours with 140 grams (about 1 cup + 2 tablespoons) all-purpose wheat flour. We love this delightful recipe especially during the winter when citrus is at it's best and short days are brighter with a sweet treat.",
    "recipeOrigin": "https://www.vermontcreamery.com/recipes/gluten-free-lemon-bars-with",
    "equipmentNeeded": [],
    "ingredients": [
      "1/2 cup blanched almond flour, such as Bob's Red Mill",
      "1/2 cup sweet rice flour, such as Bob's Red Mill",
      "1/2 cup GF oat flour, such as Bob's Red Mill",
      "2 tablespoons tapioca flour",
      "1/4 cup organic granulated sugar",
      "1/4 + 1/8 teaspoon fine sea salt",
      "6 tablespoons Vermont Creamery Unsalted Cultured Butter - 82% Butterfat cold and in 1/2-inch dice",
      "1 teaspoon vanilla extract",
      "10 tablespoons Vermont Creamery Unsalted Cultured Butter - 82% Butterfat sliced",
      "1 tablespoon lemon zest, finely grated and firmly packed",
      "1 1/2 cups organic granulated cane sugar",
      "1/8 teaspoon fine sea salt",
      "4 large eggs",
      "2 large egg yolks",
      "1 cup strained lemon juice, from about 6 large lemons",
      "optional garnishes powdered sugar, lemon wheels, and/or heavy cream and crème fraîche whipped to firm peaks"
    ],
    "instructions": [
      "Position a rack in the center of the oven and preheat to 350°F. Line an 8-inch square pan with parchment paper on all sides.",
      "In the bowl of a food processor (or stand mixer fitted with the paddle attachment) combine the almond, sweet rice, oat, and tapioca flours with the sugar and salt. Scatter the cultured butter pieces over the top and drizzle with the vanilla extract. Process until the butter is incorporated and the dough forms large clumps, 15-30 seconds in a food processor or 3-5 minutes in a stand mixer on medium speed.",
      "Dump the dough into the prepared baking pan and press evenly into the bottom.",
      "Bake the crust until golden all over, 25-30 minutes. Remove the crust from the oven and, while it's still hot, press down firmly all over with the back of a spoon. This will help it hold together when cool.",
      "Lower the oven temperature to 325°F.",
      "Place the cultured butter and lemon zest in a heatproof bowl. Place a mesh strainer over the bowl and set aside.",
      "In a medium, heavy-bottomed saucepan, whisk together the sugar, salt, eggs, and egg yolks to combine. Gradually whisk in the lemon juice.",
      "Place the pot over medium-low heat and cook, stirring constantly with a heatproof silicone spatula, until the mixture thickens slightly and reaches 160-165°F on an instant-read thermometer, 5-10 minutes. As you stir, be sure to scrape the entire bottom and corners of the pan, so that the mixture heats as evenly as possible. It will start out thick and cloudy from the undissolved sugar, then will turn thin and translucent, and finally begin to thicken and turn cloudy again as the eggs cook. Lower the heat to very low as it gets closer to being done. If the mixture starts to curdle or bubble, immediately remove it from the heat and proceed to the next step.",
      "Immediately pour the curd through the strainer and into the bowl of butter to stop the cooking. Whisk to incorporate the butter and lemon zest, making sure there are no clumps of lemon zest.",
      "Pour the cooked curd over the baked and pressed down crust.",
      "Bake the bars at 325°F (don't forget to lower the oven temp!) until the sides are barely puffed and the center wobbles like firm Jell-O when you give it a gentle shake, 15-20 minutes. It should not be wet or watery looking (underbaked!), nor should it be puffed in the center or cracking (ovebaked). Remove the bars from the oven and let cool to room temperature for 30-60 minutes, then chill until firm, 2-3 hours or overnight.",
      "When the bars are cold, grasp the parchment paper and lift the bars from the pan and onto a cutting board. Gently peel away the sides of the parchment. Trim away the outer edges of the bars, then use a large chef's knife to cut the bars into 16 squares. For the cleanest cut, dip the knife in very hot water and wipe the blade clean between cuts.",
      "Just before serving, dust the lemon bars with a bit of powdered sugar. Garnish with lemon wheels and/or whipped crème fraîche if you like.",
      "The bars will keep well, refrigerated, for up to 3 days, though the crust is the crispiest within the first 1-2 days."
    ]
  },
  {
    "title": "Bacon Ranch Keto Chicken Crust Pizza",
    "cuisine": "American",
    "course": ["Dinner", "Lunch"],
    "mainDish": "Chicken",
    "prepTime": 10,
    "cookTime": 35,
    "totalTime": null,
    "serves": 8,
    "serveType": "",
    "description": "A tasty bacon ranch topped chicken pizza crust that’s super simple to make. It uses a near zero carb pizza crust made from ground meat.",
    "recipeOrigin": "https://lowcarbyum.com/bacon-ranch-chicken-crust-pizza/",
    "equipmentNeeded": [],
    "ingredients": [
      "1 pound ground chicken",
      "1/3 cup mozzarella shredded (40 grams)",
      "1/3 cup parmesan cheese shredded (30 grams)",
      "1 teaspoon Italian seasonings basil, oregano, rosemary, and thyme",
      "1 large egg",
      "salt and ground black pepper to taste (I used 1/4 salt and dash pepper)",
      "1/3 cup avocado mayonnaise",
      "1/3 cup sour cream",
      "1/4 teaspoon dried chives",
      "1/4 teaspoon dried parsley",
      "1/4 teaspoon dried dill",
      "1/4 teaspoon garlic powder",
      "1/8 teaspoon onion powder",
      "1/8 teaspoon salt",
      "dash pepper",
      "1 cup mozzarella cheese shredded & divided (103 grams)",
      "2 medium plum tomatoes diced (85 grams)",
      "3 slices no sugar bacon cooked and chopped"
    ],
    "instructions": [
      "Preheat oven to 400°F. Line pizza pan with parchment paper.",
      "Combine the crust ingredients in a large mixing bowl. Then form into a ball.",
      "Place meat ball on parchment paper lined pizza pan. Cover with another sheet of parchment paper and roll out into a large circle. Remove top parchment paper. Is some of the crust on top of the paper? Then simply scrape it off with a rubber spatula. Add it back to the main crust.",
      "Bake meat crust in 400°F oven for 20-25 minutes or until top is browned.",
      "While crust is baking, combine sauce ingredients in medium bowl.",
      "Remove crust from oven and flip crust over on pan then remove parchment paper from top.",
      "Spread about 1/2 cup of the sauce on top of the pizza crust, then sprinkle 1/2 cup of cheese over it. Sprinkle on bacon and diced tomatoes. Sprinkle the remaining 1/2 mozzarella cheese on top.",
      "Return pizza to 400°F oven and bake for about 10 minutes. Cut into 8 slices and serve with remaining ranch sauce."
    ],
    "notes": "A silicone baking mat can be used instead of the parchment paper to roll-out the crust and flip easily after the initial baking. To make things easier, a prepared Ranch dressing can be used instead of making it from scratch."
  },
  {
    "title": "20 Minute Garlic Beef And Broccoli Lo Mein",
    "cuisine": "Chinese",
    "course": ["Dinner", "Lunch"],
    "mainDish": "Beef",
    "prepTime": 5,
    "cookTime": 15,
    "totalTime": null,
    "serves": 4,
    "serveType": "",
    "description": "20 Minute Garlic Beef and Broccoli Lo Mein has melt in your mouth tender beef with broccoli, carrots, and noodles. The sauce adds such amazing flavor to this incredibly easy meal!",
    "recipeOrigin": "https://therecipecritic.com/20-minute-garlic-beef-and-broccoli-lo-mein",
    "equipmentNeeded": [],
    "ingredients": [
      "8 ounces lo mein noodles or spaghetti noodles",
      "3 cups broccoli florets",
      "1 Tablespoon olive oil",
      "8 ounce flank steak sliced against the grain",
      "3 garlic cloves minced",
      "1 medium carrot shredded",
      "¼ cup packed brown sugar",
      "¼ cup reduced-sodium soy sauce",
      "2 Tablespoons hoisen sauce",
      "2 teaspoons sesame oil",
      "¼ teaspoon ground ginger",
      "¼ teaspoon crushed red pepper flakes",
      "¼ teaspoon pepper"
    ],
    "instructions": [
      "In a large pot with boiling water, cook the noodles according to package directions. Add the broccoli the last 5 minutes of cooking and let them cook until tender. Drain the noodles and broccoli.",
      "While the pasta is cooking, add olive oil to a medium sized skillet. Cook the steak until no longer pink. Add the garlic, and carrots and cook for a minute more.",
      "In a small bowl whisk together the brown sugar soy sauce, hoisin sauce, sesame oil, ginger, red pepper and pepper.",
      "Add the spaghetti to the skillet and pour the sauce on top and toss until incorporated."
    ],
    "notes": "Alyssa Also Recommends: Want to make this even easier? Here are a few products that I LOVE: Finedine Mixing Bowls, Calphalon Cookware Set, Staub Cast Iron Skillet"
  },
  {
    "title": "One Pot Caprese Pasta",
    "cuisine": "Italian",
    "course": ["Dinner", "Lunch"],
    "mainDish": "Pasta/Noodles",
    "prepTime": 15,
    "cookTime": null,
    "totalTime": null,
    "notes": "",
    "serves": 4,
    "serveType": "",
    "description": "How does dinner in fifteen minutes sound? How about if it’s a delicious pasta with layers of flavor that’s made entirely in one pot? Even better! Our One Pot Caprese Pasta is all of those things and more. With tender linguine, fresh mozzarella, basil, and a touch of balsamic, it’s like a comforting carby version of a great caprese salad. But it has a few other tricks up its sleeve (and it couldn’t be easier to make).",
    "recipeOrigin": "https://12tomatoes.com/one-pot-caprese-pasta",
    "equipmentNeeded": [],
    "ingredients": [
      "8 oz dry linguine",
      "1 pint cherry tomatoes, halved",
      "1 cup baby spinach leaves",
      "1/4 cup fresh basil, chopped",
      "3 garlic cloves, thinly sliced",
      "1/2 teaspoon oregano",
      "1/2 teaspoon red pepper flakes",
      "2 tablespoons extra virgin olive oil",
      "4 cups vegetable, chicken broth, or water",
      "1/2 cup fresh mozzarella bocconcini",
      "2 tablespoons balsamic vinegar",
      "Kosher salt and freshly ground black pepper, to taste"
    ],
    "instructions": [
      "In a large pot or deep pan, arrange linguine, tomatoes, spinach, garlic, and basil. Sprinkle with salt, pepper, oregano, red pepper flake, and drizzle with olive oil.",
      "Pour 4 cups of broth or water into the pot and bring to a boil. Reduce heat to medium and cook, stirring occasionally, until liquid is nearly evaporated and pasta is al dente, 8-10 minutes.",
      "Remove from heat and stir in mozzarella and more basil, if desired. Adjust season as needed, drizzle with balsamic vinegar, and enjoy!"
    ]
  },
  {
    "title": "Butter Chicken | Chicken Butter Masala",
    "cuisine": "Indian",
    "course": "Dinner",
    "mainDish": "Chicken",
    "prepTime": null,
    "cookTime": null,
    "totalTime": null,
    "notes": "",
    "serves": null,
    "serveType": "",
    "description": "Butter chicken is one of the most popular chicken recipes in India. Golden fried chicken pieces are cooked in a creamy tomato base. It is best served with roti, naan or pulao. ",
    "recipeOrigin": "https://www.youtube.com/watch?v=D_fYk8mBaF4",
    "equipmentNeeded": [],
    "ingredients": [
      "200 Grams Boneless Chicken",
      "1 Tsp Pound Ginger & Garlic",
      "2 Tsp Hung Curd",
      "Juice Of 1 /2 Lemon ",
      "1 Tsp Kashmiri Chili Powder",
      "1 /2 Tsp Garam Masala",
      "1 /2 Tsp Salt",
      "1 Tbsp Oil",
      "1 Tbsp Butter",
      "1 Tbsp Oil",
      "2 Onions - Chopped",
      "1 Tsp Pound Ginger & Garlic",
      "3 Tomatos - Chopped",
      "3 Kashmiri Red Chili",
      "1 Tsp Salt",
      "1 Tsp Cumin Powder",
      "1 /2 Tsp Coriander Powder",
      "1 Tsp Garam Masala",
      "2 Tbsp Water",
      "10 Cashew Nuts",
      "1 /4 Cup Water",
      "2 Tbsp Butter",
      "1 Tsp Kashmiri Chili Powder",
      "Water",
      "1 /4 Cup Fresh Cream",
      "Kasuri Methi",
      "Coriander Leaves"
    ],
    "instructions": [
      "Take the boneless chicken pieces in a bowl, add lemon juice, hung curd, ginger garlic paste, red chili powder, garam masala, salt",
      "Mix everything well, and marinate the chicken for about 30 minutes ",
      "Heat a pan and add some oil ",
      "Fry the chicken pieces till they are cooked and keep them aside",
      "In a pan  heat some oil and butter, add onions, ginger, garlic and saute them",
      "Once they are golden brown, add tomatoes, cashews and saute them",
      "Add kashmiri red chilies, cumin powder, coriander powder, garam masala powder, salt cook them with little water",
      "Once they are cooked, cool them and grind them to a fine puree",
      "Heat the same pan, add some butter, red chili powder and add the puree onto the pan ",
      "Bring the gravy to a boil, add the fried chicken pieces and fresh cream and simmer the gravy for about 10 minutes",
      "Finally, add kasuri methi and coriander leaves and mix well",
      "Serve it hot with naan, roti or pulao"
    ]
  },
  {
    "title": "Lemon Bundt Cake",
    "cuisine": "American",
    "course": "Dessert",
    "mainDish": "Other",
    "prepTime": 75,
    "cookTime": 75,
    "totalTime": null,
    "notes": "",
    "serves": 8,
    "serveType": "",
    "description": "This classic lemon bundt cake recipe is perfect for any occasion: a bridal shower, summer BBQ, or even a treat for your family on a casual night in. The lemon glaze makes this cake perfectly moist. Top it with icing and zest and enjoy this beautiful and delicious treat.",
    "recipeOrigin": "https://tasty.co/recipe/lemon-bundt-cake",
    "equipmentNeeded": [],
    "ingredients": [
      "3 cups all-purpose flour",
      "2 teaspoons baking powder",
      "1 cup unsalted butter, 2 sticks, room temperature",
      "2 cups granulated sugar",
      "1 teaspoon kosher salt",
      "3 large eggs, room temperature",
      "2 tablespoons lemon zest",
      "¼ cup lemon juice",
      "1 teaspoon vanilla extract",
      "1 cup whole milk",
      "nonstick cooking spray, for greasing",
      "½ cup granulated sugar", "¼ cup lemon juice",
      "2 cups powdered sugar, sifted",
      "3 tablespoons lemon juice",
      "1 lemon, zested"
    ],
    "instructions": [
      "Preheat the oven to 350˚F (180˚C).",
      "Make the cake: In a medium bowl, whisk together the flour and baking powder.",
      "In a large bowl, cream the butter, sugar, and salt with an electric hand mixer until fluffy, about 3 minutes. Add the eggs, one at a time, beating until fully incorporated before adding the next. Add the lemon zest, lemon juice, and vanilla and beat to combine.",
      "Add half the flour and beat to combine, then beat in the milk, then add the rest of the flour and beat just until incorporated. Scrape down the sides of the bowl with a rubber spatula and make sure any floury spots are incorporated.",
      "Grease a 10-inch (25-cm) bundt pan with nonstick spray. Spoon the batter into the pan and smooth the top. Gently tap the pan against the counter to release any air bubbles.",
      "Bake the cake for 50 minutes, until a toothpick inserted in the center comes out clean.",
      "While the cake is baking, make the lemon glaze: In a small microwave-safe bowl, combine the sugar and lemon juice. Microwave for 1 minute, stirring halfway through, until the sugar is completely dissolved. Set aside.",
      "Make the lemon icing: Sift the powdered sugar into a medium bowl. Add the lemon juice and whisk until smooth.",
      "After the cake is done baking, let cool in the pan for 10 minutes, then invert onto a wire rack set over a baking sheet and remove the bundt pan. Use a knife to loosen the cake around the edges, if needed.",
      "Use a skewer or fork to poke holes all over the top and sides of the cake. Brush the cake with the lemon glaze. If the glaze drips off, let the cake cool for a few more minutes, then continue brushing on the glaze. Let cool completely, at least 1 hour.",
      "Pour the icing over the top of the cake, letting it drip down the sides. Grate lemon zest over the icing. Let the glaze dry completely, about 30 minutes.",
      "Transfer the cake to a serving platter, slice, and serve.",
      "Enjoy!"
    ]
  }, {
    "title": "Fajita Breakfast Burritos",
    "cuisine": "Tex-Mex",
    "course": "Breakfast",
    "mainDish": "Sausage",
    "prepTime": 30,
    "cookTime": 10,
    "totalTime": null,
    "notes": "",
    "serves": 8,
    "serveType": "burritos",
    "description": "Fajita Breakfast Burritos never tasted so good, especially when you don’t want to make breakfast! These make ahead breakfast burritos are an easy meal prep breakfast to make any time of year.",
    "recipeOrigin": "https://fitfoodiefinds.com/fajita-breakfast-burritos",
    "equipmentNeeded": [],
    "ingredients": [
      "2 tablespoons olive oil",
      "2 medium russet potatoes, cut into half-inch cubes (~2 cups cubed)",
      "1 tablespoon minced garlic",
      "1 teaspoon chili powder",
      "1/2 teaspoon ground cumin",
      "1/4 teaspoon paprika",
      "1/8 teaspoon salt",
      "1 large yellow pepper, diced",
      "1 large red pepper, diced",
      "1/2 yellow onion, minced",
      "8 large eggs",
      "2 tablespoons unsweetened almond milk",
      "salt and pepper, to taste",
      "2 tablespoons olive oil",
      "12 oz. uncooked breakfast sausage (any kind will work and option to use pre-cooked)",
      "1 cup shredded cheddar cheese",
      "1 15-oz. can refried beans",
      "8 large flour tortillas"
    ],
    "instructions": [
      "Heat a large skillet over medium/high heat. Add olive oil.",
      "When olive oil is fragrant add potatoes and saute for about 5 minutes. Stir every couple of minutes.",
      "Next, add garlic, chili powder, cumin, paprika, and salt to the potatoes. Mix until they are covered with spices and cook for an additional 3-4 minutes.",
      "Finally, add yellow pepper, red pepper, and onion to the potatoes and mix until all veggies are covered in spices. Cover and cook for an additional 5 minutes, stirring every couple minutes. Remove from heat and set aside.",
      "Whisk 8 large eggs in a large bowl. Add almond milk, salt and, pepper and whisk until ingredients are combined.",
      "Next, heat a large skillet over medium/high heat. Add olive oil to the pan. When olive oil is fragrant add eggs to the skillet.",
      "Move eggs around consistently until eggs are scrambled. Remove from heat.",
      "In a large skillet, cook uncooked breakfast sausage. Saute over medium-high heat for 7-10 minutes, moving the sausages around consistently so they don’t burn.* Remove from heat once fully cooked in the middle.",
      "When the breakfast sausage is cool, chop them into bite-size pieces and set aside",
      "Measure out 1 cup of cheese, 15 oz. refried beans, and 8 large flour tortillas and set aside.",
      "Now it’s time to assemble your breakfast burritos! Place 8 tortillas on a flat surface and smear 2-3 tablespoons of refried beans onto the bottom of each tortilla. Then, evenly distribute the fajita veggies, breakfast sausage, cheese, and eggs to each burrito.",
      "Create burritos by tightly wrap each tortilla.",
      "Option to eat immediately or make them crispy!",
      "To give them a crunch, heat 1/2 tablespoon of olive oil in a large skillet. When olive oil is fragrant, fry burritos for 30 seconds to 1 minute on each side or until golden brown.",
      "Serve with your favorite salsa and plain Greek yogurt."
    ]
  }, {
    "title": "Chocolate Pecan Pie",
    "cuisine": "American",
    "course": "Dessert",
    "mainDish": "Other",
    "prepTime": 15,
    "cookTime": 50,
    "totalTime": null,
    "notes": "",
    "serves": 12,
    "serveType": "people",
    "description": "Fudge Chocolate Pecan Pie is the best, decadent dessert to hit your holiday table!",
    "recipeOrigin": "https://cafedelites.com/chocolate-pecan-pie",
    "equipmentNeeded": [],
    "ingredients": [
      "2 cups pecans",
      "6 ounces 70% chocolate roughly chopped into pieces (or semisweet chocolate)",
      "1/2 cup unsalted butter melted",
      "2 tablespoons unsweetened cocoa powder (I use Hershey's)",
      "3/4 cup golden syrup maple syrup, rice syrup or light corn syrup",
      "3/4 cup light brown sugar packed",
      "2 tablespoons all purpose flour",
      "2 tablespoons bourbon optional",
      "1 tablespoon pure vanilla extract",
      "3/4 teaspoon salt",
      "4 large eggs whisked",
      "9 inch pie crust or pie shell"
    ],
    "instructions": [
      "Preheat oven 350°F (175°C) with rack on lowest position in oven. Prepare pie crust. If using uncooked pie crust, prick the base a few times with a fork to prevent air bubbles before pouring in the filling.",
      "When oven is hot, toast pecans on a baking sheet for 10 minutes. Roughly chop half of the toasted pecans. Reserve the other half for decorating the top of the pie.",
      "Fill a small pot 1/3 of the way with water and bring to a boil over medium-high heat.",
      "Reduce heat to low and place a heat-proof bowl on the pot. Fill the bowl with the chocolate and stir continuously until the chocolate is melted. ",
      "Add the butter to the chocolate, stirring well to combine until butter is melted. Mix in the cocoa powder until completely dissolved.",
      "Take the bowl off the heat. Whisk in syrup, sugar, flour, bourbon, vanilla and salt.",
      "Add the eggs and whisk well to combine. Fold in chopped pecans. Pour into prepared pie shell and top with remaining pecans.",
      "Bake for 50-55 minutes or until centre is just set to the touch but still a little jiggly underneath. If your pie is browning too fast, loosely tent with foil.",
      "The pie will be puffed up as soon as it comes out of the oven, but it will deflate and flatten as it cools. Let cool on a wire rack for about 4 hours and serve warm, or refrigerate to chill overnight."
    ]
  }, {
    "title": "Apple Cider Beignet",
    "cuisine": "American",
    "course": ["Breakfast", "Snack"],
    "mainDish": "Other",
    "prepTime": 20,
    "cookTime": 45,
    "totalTime": null,
    "notes": "",
    "serves": 36,
    "serveType": "beignets",
    "description": "Take beignets to the next level with the addition of apple cider and fragrant apple pie spice. The caramel dipping sauce gives this dish a double dose of apple cider for maximum fall flavor. The recipe yields enough for a crowd, so serve these as part of an autumn brunch spread for all of your family and friends.",
    "recipeOrigin": "https://tasty.co/recipe/apple-cider-beignet",
    "equipmentNeeded": [],
    "ingredients": [
      "1 ½ cups apple cider",
      "1 cup lukewarm water",
      "¼ cup granulated sugar",
      "1 package active dry yeast",
      "2 large eggs",
      "1 ½ teaspoons kosher salt",
      "1 tablespoon apple pie spice, divided, plus 2 teaspoons",
      "1 cup evaporated milk",
      "½ stick unsalted butter, melted",
      "7 cups bread flour, plus more for dusting",
      "nonstick cooking spray, for greasing",
      "½ cup powdered sugar",
      "4 qt canola oil",
      "2 cups apple cider",
      "½ cup brown sugar",
      "¼ cup heavy cream",
      "½ stick unsalted butter, cubed",
      "¼ teaspoon kosher salt"
    ],
    "instructions": [
      "Make the beignets: In a large skillet over medium-high heat, bring the apple cider to a boil, then cook until reduced by half, about 10 minutes. Remove the pan from heat and let cool.",
      "In a liquid measuring cup or medium bowl, whisk together the water, granulated sugar, and yeast. 3. Let sit for 10 minutes, until foamy.",
      "In a large bowl, whisk together the reduced apple cider, eggs, salt, 2 teaspoons apple pie spice, the evaporated milk, and melted butter.",
      "Add the yeast mixture to the egg mixture and stir to combine.",
      "Add half of the flour and stir with a wooden spoon to incorporate. Add the remaining flour and stir until the dough comes together in a ball.",
      "Turn the dough out onto a lightly floured surface. Knead until smooth, about 10 minutes.",
      "Grease a clean large bowl with nonstick spray and place the dough in the bowl. Cover with plastic wrap or a kitchen towel and let rise in a warm place for at least 2 hours, until the dough has doubled in size.",
      "In a small mixing bowl, whisk together powdered sugar and remaining tablespoon of apple pie spice. Set aside.",
      "Make the caramel: In a large skillet over medium-high heat, bring the apple cider to a boil and cook until reduced by half, about 10 minutes.",
      "Add the brown sugar to the reduced cider and continue cooking until the sugar dissolves completely and the mixture turns a deep amber color, about 5 minutes.",
      "Add the heavy cream and whisk quickly to incorporate. Gradually add the cubed butter and whisk to melt completely. Whisk in the salt, then remove the pot from the heat. Cover with a lid to keep warm until ready to serve.",
      "In a large pot, heat the canola oil over medium heat until it reaches 350°F (180°C). Place a wire rack over a baking sheet and set nearby.",
      "Turn the dough out onto a lightly floured surface and roll into a 12-inch (30 cm) square. Cut the dough into 36 2-inch (5 cm) squares.",
      "Working in batches, fry the dough squares in the hot oil until light golden brown, about 1 minute per side. Transfer to the wire rack and immediately dust with the apple pie spice sugar.",
      "Serve the beignets warm with the cider caramel alongside for dipping.",
      "Enjoy!"
    ]
  }
]